Revit 2024 API
RoutingPreferenceRule.MEPPartId Property
 The referenced MEPPart (segment or fitting) type in this rule. It may be InvalidElementId if no MEPPart will be allowed when the conditions satisfy the criteria in this rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId MEPPartId { get; }
Visual Basic
Public ReadOnly Property MEPPartId As ElementId
	Get
Visual C++
public:
property ElementId^ MEPPartId {
	ElementId^ get ();
}
See Also
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace